Documents/ТК_ГрафикЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_ГрафикЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТК_ГрафикиЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезТСД</Name>
					<Comment>Заказ по ТСД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодичностиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПериодичности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПоДнямНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки (дней)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентЗаказа</Name>
					<Comment>Регламентированный учет в заказе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправкиЗаказа</Name>
					<Comment>Время отправки заказа поставщику</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаМинимальногоЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМинимальногоЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миксация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеУтверждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Утверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыПериодичностиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПериодичностиЗаказов</Name>
			<Comment>Виды периодичности заказов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неактуальный</Name>
					<Comment>График неактуальный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
					<Comment>Периодичность не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежедневно</Name>
					<Comment>В течении недели</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Еженедельно</Name>
					<Comment>Раз в неделю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНечетнымНеделям</Name>
					<Comment>По нечетным неделям</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧетнымНеделям</Name>
					<Comment>По четным неделям</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВДвеНедели</Name>
					<Comment>Раз в две недели</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
					<Comment>Раз в месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежеквартально</Name>
					<Comment>Раз в квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинРазВУказанноеКоличествоДней</Name>
					<Comment>Один раз в указанное количество дней</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СкладыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СкладыКомпании</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенСебестоимости</Name>
					<Comment>Тип цен из которых считается себестоимость когда не найдены партии при возвратах и прочих оприходованиях</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Comment>Тип цен розничной торговли (для розничного склада)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Розничный</Name>
					<Comment>Истина - склад розничный, иначе - оптовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Районы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиУчетПоХарактеристикам</Name>
					<Comment>Устаревший, использовать вместо регистр "ТК_УчетХарактеристикНаСкладах"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Global_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставки</Name>
					<Comment>(АСУ by 4ок)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Номер маршрута доставки (0 если склад не торгует)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АссортиментнаяМатрица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АссортиментнаяМатрица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияПоКОАТУУ</Name>
					<Comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторКОАТУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСкладТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Автомата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАвтомата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВендингАвтоматов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ТК_ГрафикЗаказов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ГрафикЗаказов"));
	
	Если Объект.ЧерезТСД Тогда
		Элементы.ЧерезТСД.ЦветТекстаЗаголовка = WebЦвета.Пурпурный;	
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
КонецПроцедуры


#КонецОбласти


#Область УправлениеЭлементамиФормы

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Если НЕ Параметры.Ключ.Пустая() И Объект.Проведен 
		И НЕ НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()) Тогда 
		ЭтаФорма.ТолькоПросмотр = ИСТИНА;
	Иначе
		Если НЕ Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.ТорговаяПлощадка) И ЗначениеЗаполнено(Объект.Договор) Тогда 
			Элементы.Контрагент.ТолькоПросмотр = ИСТИНА;
			Элементы.Договор.ТолькоПросмотр = ИСТИНА;
			Элементы.ТорговаяПлощадка.ТолькоПросмотр = ИСТИНА;
		КонецЕсли;
		
		УправлениеДиалогом();
		
	КонецЕсли;
	
	Элементы.Миксация.Видимость							= ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
	УправлениеДоговором();
	//Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.ДатаОкончанияДействия < ТекущаяДата() Тогда
	//	Элементы.Договор.ЦветФона			= WebЦвета.Коралловый;
	//	Элементы.Договор.ЦветТекстаЗаголовка= WebЦвета.Коралловый;
	//	Элементы.Договор.ЦветРамки			= WebЦвета.Коралловый;
	//	Элементы.Договор.Заголовок = "Договор ПРОСРОЧЕН...";
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоговором()
	
	Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда
		Элементы.Договор.ЦветФона			= WebЦвета.Коралловый;
		Элементы.Договор.ЦветТекстаЗаголовка= WebЦвета.Коралловый;
		Элементы.Договор.ЦветРамки			= WebЦвета.Коралловый;
		Элементы.Договор.Заголовок = "Договор ПРОСРОЧЕН...";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Объект.Договор) И Объект.Контрагент <> Объект.Договор.Контрагент Тогда
		Элементы.Договор.ЦветФона						= WebЦвета.Коралловый;
		Элементы.Договор.ЦветРамки						= WebЦвета.Красный;
		Элементы.Контрагент.ЦветФона					= WebЦвета.Коралловый;
		Элементы.Контрагент.ЦветРамки					= WebЦвета.Красный;
		Элементы.Контрагент.ЦветТекстаЗаголовка			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветРамки			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветТекстаЗаголовка	= WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Элемент.ТекстРедактирования, 
	ЭтотОбъект, 
	"Объект.Комментарий");
	
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Объект.Договор) И Объект.Контрагент <> Объект.Договор.Контрагент Тогда
		Элементы.Договор.ЦветФона						= WebЦвета.Коралловый;
		Элементы.Договор.ЦветРамки						= WebЦвета.Красный;
		Элементы.Контрагент.ЦветФона					= WebЦвета.Коралловый;
		Элементы.Контрагент.ЦветРамки					= WebЦвета.Красный;
		Элементы.Контрагент.ЦветТекстаЗаголовка			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветРамки			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветТекстаЗаголовка	= WebЦвета.Красный;
	Иначе
		Элементы.Договор.ЦветФона						= Новый Цвет;
		Элементы.Договор.ЦветРамки						= Новый Цвет;
		Элементы.Контрагент.ЦветФона					= Новый Цвет;
		Элементы.Контрагент.ЦветРамки					= Новый Цвет;
		Элементы.Контрагент.ЦветТекстаЗаголовка			= Новый Цвет;
		Элементы.КонтрагентДоговора.ЦветРамки			= Новый Цвет;
		Элементы.КонтрагентДоговора.ЦветТекстаЗаголовка	= Новый Цвет;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда
		Элементы.Договор.ЦветФона			= WebЦвета.Коралловый;
		Элементы.Договор.ЦветТекстаЗаголовка= WebЦвета.Коралловый;
		Элементы.Договор.Заголовок = "Договор ПРОСРОЧЕН...";
	Иначе
		Элементы.Договор.ЦветФона			= Новый Цвет;
		Элементы.Договор.ЦветТекстаЗаголовка= Новый Цвет;
		Элементы.Договор.Заголовок = "Договор:";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
// управляет видимостью элементов диалога
Процедура УправлениеДиалогом()
	
	Элементы.КоличествоДнейПериодичности.ТолькоПросмотр	= Объект.ПериодичностьЗаказа <> ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","ОдинРазВУказанноеКоличествоДней");
	Элементы.СрокПоставки.ТолькоПросмотр				= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.ВремяОтправкиЗаказа.ТолькоПросмотр			= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.СуммаМинимальногоЗаказа.ТолькоПросмотр		= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный") ИЛИ ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
	Элементы.ДниНедели.ТолькоПросмотр					= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.ПериодичностьПоДнямНедели.ТолькоПросмотр	= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.КоличествоМинимальногоЗаказа.ТолькоПросмотр= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный") ИЛИ ЗначениеЗаполнено(Объект.СуммаМинимальногоЗаказа);
	Элементы.Миксация.ТолькоПросмотр					= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный") ИЛИ ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
	Элементы.Миксация.Видимость							= ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМинимальнымЗаказом()
	Элементы.СуммаМинимальногоЗаказа.ТолькоПросмотр = ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа) ИЛИ Объект.Миксация;
	Элементы.КоличествоМинимальногоЗаказа.ТолькоПросмотр = ЗначениеЗаполнено(Объект.СуммаМинимальногоЗаказа);
	Элементы.Миксация.Видимость = ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа) ИЛИ Объект.Миксация;
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьЗаказаПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура СуммаМинимальногоЗаказаПриИзменении(Элемент)
	УправлениеМинимальнымЗаказом()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМинимальногоЗаказаПриИзменении(Элемент)
	УправлениеМинимальнымЗаказом()
КонецПроцедуры

&НаКлиенте
Процедура МиксацияПриИзменении(Элемент)
	УправлениеМинимальнымЗаказом()
КонецПроцедуры

&НаКлиенте
Процедура ДниНеделиПриИзменении(Элемент)
	Если СтрДлина(СокрЛП(Объект.ДниНедели))>1 И Объект.ПериодичностьЗаказа <> ПредопределенноеЗначение("Перечисление.ВидыПериодичностиЗаказов.Ежедневно")
		И Объект.ПериодичностьЗаказа <> ПредопределенноеЗначение("Перечисление.ВидыПериодичностиЗаказов.НеИспользовать") Тогда
		ПоказатьПредупреждение(,"Установленная периодичность '"+Объект.ПериодичностьЗаказа+"' подразумевает выбор только одного дня недели!!!");	
	ИначеЕсли СтрДлина(СокрЛП(Объект.ДниНедели))=1 И Объект.ПериодичностьЗаказа = ПредопределенноеЗначение("Перечисление.ВидыПериодичностиЗаказов.Ежедневно") Тогда
		ПоказатьПредупреждение(,"Установленная периодичность '"+Объект.ПериодичностьЗаказа+"'"+Символы.ПС+" НЕ подразумевает выбор только одного дня недели!!!");
	КонецЕсли;
	
КонецПроцедуры

функция ПолучитьЗначениеПеречисления (ИмяПеречисления,ИмяЭлемента)
	Возврат перечисления[ИмяПеречисления][ИмяЭлемента];	
КонецФункции


&НаКлиенте
Процедура ДниНеделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДниНедели",ЭтотОбъект,Ложь);
	ОткрытьФорму("ОбщаяФорма.ДниНедели", Новый Структура("Переодичность,ДниНедели", Ложь, СокрЛП(Элементы.ДниНедели.ТекстРедактирования)), ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДниНедели(Результат,Переодичность)	Экспорт
	Если Переодичность Тогда
		Объект.ПериодичностьПоДнямНедели = Результат;
	Иначе
		Объект.ДниНедели = Результат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПериодичностьПоДнямНеделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПолучитьДниНедели",ЭтотОбъект,Истина);
	ОткрытьФорму("ОбщаяФорма.ДниНедели", Новый Структура("Переодичность,ДниНедели,ДеньПоставкиПоДнямНедели", Истина, СокрЛП(Элементы.ДниНедели.ТекстРедактирования), СокрЛП(Элементы.ПериодичностьПоДнямНедели.ТекстРедактирования)), ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//СтандартнаяОбработка=Ложь;
КонецПроцедуры


&НаКлиенте
Процедура НачалоВыбораПоСкладу(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяПлощадкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ВыборПоСкладу Тогда
		СтандартнаяОбработка = Ложь;
		НачалоВыбораПоСкладу(Элемент);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТорговаяПлощадкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыборПоСкладу Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ТорговаяПлощадка = получитьЗначениеРеквизита(ВыбранноеЗначение,"ТорговаяПлощадка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
функция получитьЗначениеРеквизита (эл,имяРеквизита)
	Возврат эл[имяРеквизита];
КонецФункции

&НаКлиенте
Процедура ВыборПоСкладуПриИзменении(Элемент)
	Если ВыборПоСкладу Тогда
		Элемент.ЦветТекстаЗаголовка = WebЦвета.Зеленый;	
	Иначе
		Элемент.ЦветТекстаЗаголовка = Новый Цвет;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЧерезТСДПриИзменении(Элемент)
	Если Объект.ЧерезТСД Тогда
		Элемент.ЦветТекстаЗаголовка = WebЦвета.Пурпурный;	
	Иначе
		Элемент.ЦветТекстаЗаголовка = Новый Цвет;	
	КонецЕсли;
	
КонецПроцедуры
